midibox/mios32/modules/esp8266/esp8266_fw.c
// $Id$
//! \defgroup ESP8266
//!
//!  ESP8266 Firmware Access Routines
//!
//!  Inspired from "esptool.py":
//!  -> https://github.com/themadinventor/esptool
//!
//!  Firmware image format and serial protocol:
//!  -> https://github.com/themadinventor/esptool/wiki
//!
//! \{
/* ==========================================================================
 *
 *  Copyright (C) 2016 Thorsten Klose (tk@midibox.org)
 *  Licensed for personal non-commercial use only.
 *  All other rights reserved.
 * 
 * ==========================================================================
 */


/////////////////////////////////////////////////////////////////////////////
// Include files
/////////////////////////////////////////////////////////////////////////////

#include <mios32.h>
#include <string.h>

#include "esp8266.h"
#include "esp8266_fw.h"


//! Note: it's possible to disable the FW access part if not required
#if ESP8266_FW_ACCESS_ENABLED


/////////////////////////////////////////////////////////////////////////////
// for optional debugging messages via MIOS32_MIDI_SendDebug*
/////////////////////////////////////////////////////////////////////////////

#define DEBUG_VERBOSE_LEVEL 2

#ifndef DEBUG_MSG
# define DEBUG_MSG MIOS32_MIDI_SendDebugMessage
#endif


/////////////////////////////////////////////////////////////////////////////
// Local defines
/////////////////////////////////////////////////////////////////////////////

// These are the currently known commands supported by the ROM
#define ESP_FLASH_BEGIN 0x02
#define ESP_FLASH_DATA  0x03
#define ESP_FLASH_END   0x04
#define ESP_MEM_BEGIN   0x05
#define ESP_MEM_END     0x06
#define ESP_MEM_DATA    0x07
#define ESP_SYNC        0x08
#define ESP_WRITE_REG   0x09
#define ESP_READ_REG    0x0a

// Maximum block sized for RAM and Flash writes, respectively.
// Reduced to 0x100 so that the buffers fit in stack memory
#define ESP_RAM_BLOCK   0x100
#define ESP_FLASH_BLOCK 0x100

// First byte of the application image
#define ESP_IMAGE_MAGIC 0xe9

//Initial state for the checksum routine
#define ESP_CHECKSUM_MAGIC 0xef

// OTP ROM addresses
#define ESP_OTP_MAC0    0x3ff00050
#define ESP_OTP_MAC1    0x3ff00054
#define ESP_OTP_MAC3    0x3ff0005c


/////////////////////////////////////////////////////////////////////////////
// Firmware images which should be downloaded
/////////////////////////////////////////////////////////////////////////////

#if ESP8266_FW_DEFAULT_FIRMWARE
#include "ESP8266_AT_V0.51/0x00000.inc"
#include "ESP8266_AT_V0.51/0x40000.inc"
#else
// must be provided by the user
# include "esp8266_fw.inc"
#endif


/////////////////////////////////////////////////////////////////////////////
// Local variables
/////////////////////////////////////////////////////////////////////////////

static volatile u16 timeout_ctr;


/////////////////////////////////////////////////////////////////////////////
//! Will be called from ESP8266_Periodic_mS to handle the timeout counter
/////////////////////////////////////////////////////////////////////////////
s32 ESP8266_FW_Periodic_mS(void)
{
  // timeout counter
  if( timeout_ctr )
    --timeout_ctr;

  return 0; // no error
}


/////////////////////////////////////////////////////////////////////////////
//! Read bytes from the serial port while performing SLIP unescaping.
//! Note: terminalMode has to be disabled before calling this function!
//! \param[in] buffer contains the bytes which should be read
//! \param[in] size how many bytes should be read
//! \return < 0 on errors
//! \return >= 0: number of read bytes
/////////////////////////////////////////////////////////////////////////////
s32 ESP8266_FW_Read(u8 *buffer, u32 size)
{
  u8 dev_uart = ESP8266_UartGet();
  if( !dev_uart )
    return -1; // no UART assigned

  u8 uart = dev_uart & 0xf;

  u32 pos;
  for(pos=0; pos<size; ++pos) {
    s32 c;
    timeout_ctr = 100; // wait for up to 100 uS
    while( (c=MIOS32_UART_RxBufferGet(uart)) == -2 ) {
      if( timeout_ctr == 0 ) {
#if DEBUG_VERBOSE_LEVEL >= 2
	DEBUG_MSG("[ESP8266_FW_Read] TIMEOUT (1)\n");
#endif
	return -2; // timeout
      }
    }

    if( c < 0 ) {
#if DEBUG_VERBOSE_LEVEL >= 2
      DEBUG_MSG("[ESP8266_FW_Read] transfer failed, status %d\n", c);
#endif
      return -3; // transfer failed
    }

    if( c == 0xdb ) {
      timeout_ctr = 100; // wait for up to 100 uS
      while( (c=MIOS32_UART_RxBufferGet(uart)) == -2 ) {
	if( timeout_ctr == 0 ) {
#if DEBUG_VERBOSE_LEVEL >= 2
	  DEBUG_MSG("[ESP8266_FW_Read] TIMEOUT (2)\n");
#endif
	  return -2; // timeout
	}
      }

      if( c < 0 ) {
#if DEBUG_VERBOSE_LEVEL >= 2
	DEBUG_MSG("[ESP8266_FW_Read] additional read transfer failed, status %d\n", c);
#endif
	return -4; // transfer failed
      }

      if( c == 0xdd )
	buffer[pos] = 0xdb;
      else if( c == 0xdc )
	buffer[pos] = 0xc0;
      else {
#if DEBUG_VERBOSE_LEVEL >= 2
	DEBUG_MSG("[ESP8266_FW_Read] SLIP protocol failed, received 0x%02x instead of 0xdc or oxdd!\n", c);
#endif
	return -5; // invalid slip escape
      }
    } else {
      buffer[pos] = c;
    }
  }

  return pos; // no error
}


/////////////////////////////////////////////////////////////////////////////
//! Write bytes to the serial port while performing SLIP escaping.
//! Note: terminalMode has to be disabled before calling this function!
//! \param[in] buffer contains the bytes which should be written
//! \param[in] size how many bytes should be written
//! \param[in] buffer2 optional second data buffer
//! \param[in] size2 how many bytes should be written
//! \return < 0 on errors
//! \return >= 0: number of written bytes
/////////////////////////////////////////////////////////////////////////////
s32 ESP8266_FW_Write(u8 *buffer, u32 size, u8 *buffer2, u32 size2)
{
  u8 dev_uart = ESP8266_UartGet();
  if( !dev_uart )
    return -1; // no UART assigned

  u8 uart = dev_uart & 0xf;

  MIOS32_UART_TxBufferPut(uart, 0xc0);

