midibox/mios32/modules/esp8266/esp8266_fw.c
  // first buffer
  s32 status = 0;
  u32 pos;
  for(pos=0; pos<size; ++pos) {
    u8 c = buffer[pos];
    if( c == 0xdb ) {
      status |= MIOS32_UART_TxBufferPut(uart, 0xdb);
      status |= MIOS32_UART_TxBufferPut(uart, 0xdd);
    } else if( c == 0xc0 ) {
      status |= MIOS32_UART_TxBufferPut(uart, 0xdb);
      status |= MIOS32_UART_TxBufferPut(uart, 0xdc);
    } else {
      status |= MIOS32_UART_TxBufferPut(uart, c);
    }
  }

  // optional second buffer
  if( buffer2 && size2 ) {
    for(pos=0; pos<size2; ++pos) {
      u8 c = buffer2[pos];
      if( c == 0xdb ) {
	status |= MIOS32_UART_TxBufferPut(uart, 0xdb);
	status |= MIOS32_UART_TxBufferPut(uart, 0xdd);
      } else if( c == 0xc0 ) {
	status |= MIOS32_UART_TxBufferPut(uart, 0xdb);
	status |= MIOS32_UART_TxBufferPut(uart, 0xdc);
      } else {
	status |= MIOS32_UART_TxBufferPut(uart, c);
      }
    }
  }

  status |= MIOS32_UART_TxBufferPut(uart, 0xc0);

#if DEBUG_VERBOSE_LEVEL >= 2
  if( status < 0 ) {
    DEBUG_MSG("[ESP8266_FW_Write] failed transfer, status %d (combined)\n", status);
  }
#endif

  return pos; // no error
}


/////////////////////////////////////////////////////////////////////////////
//! Calculate checksum of a blob, as it is defined by the ROM.
//! \return < 0 on errors
//! \return >= 0: the checksum
/////////////////////////////////////////////////////////////////////////////
s32 ESP8266_FW_Checksum(u8 *buffer, u32 size, u8 initial_chk)
{
  u8 chk = initial_chk;
  u32 pos;
  for(pos=0; pos<size; ++pos) {
    chk ^= *(buffer++);
  }
  return chk;
}


/////////////////////////////////////////////////////////////////////////////
//! receive a response to a command
//! \return < 0 on errors
//! \return >= 0: number of received bytes (in buffer)
/////////////////////////////////////////////////////////////////////////////
s32 ESP8266_FW_ReceiveReply(u8 *op_ret, u32 *val_ret, u8 *buffer, u32 buffer_max_size)
{
  *op_ret = 0;
  *val_ret = 0;

  {
    u8 c;
    s32 status;
    if( (status=ESP8266_FW_Read(&c, 1)) < 0 ) {
#if DEBUG_VERBOSE_LEVEL >= 2
      DEBUG_MSG("[ESP8266_FW_ReceiveReply] initial read failed, status %d\n", status);
#endif
      return -2; // failed read
    }

    if( c != 0xc0 ) {
#if DEBUG_VERBOSE_LEVEL >= 2
      DEBUG_MSG("[ESP8266_FW_ReceiveReply] initial read returned 0x%02x instead of 0xc0\n", c);
#endif
      return -3; // invalid header start
    }
  }

  u8 len_ret = 0;
  {
    u8 hdr[8];
    s32 status;
    if( (status=ESP8266_FW_Read(hdr, 8)) < 0 ) {
#if DEBUG_VERBOSE_LEVEL >= 2
      DEBUG_MSG("[ESP8266_FW_ReceiveReply] header read failed, status %d\n", status);
#endif
      return -4; // failed read
    }

    if( hdr[0] != 0x01 ) {
#if DEBUG_VERBOSE_LEVEL >= 2
      DEBUG_MSG("[ESP8266_FW_ReceiveReply] invalid header indicator!\n");
      MIOS32_MIDI_SendDebugHexDump(hdr, 8);
#endif
      return -5; // invalid header indicator
    }

    *op_ret=hdr[1];
    len_ret = ((u32)hdr[2] << 0) | ((u32)hdr[3] << 8);
    *val_ret = ((u32)hdr[4] << 0) | ((u32)hdr[5] << 8) | ((u32)hdr[6] << 16) | ((u32)hdr[7] << 24);

    //MIOS32_MIDI_SendDebugHexDump(hdr, 8);
  }

  if( len_ret ) {

    if( len_ret > buffer_max_size ) {
#if DEBUG_VERBOSE_LEVEL >= 2
      DEBUG_MSG("[ESP8266_FW_ReceiveReply] FW wants to send %d bytes, but app limits to %d bytes\n", len_ret, buffer_max_size);
#endif
      return -6; // too many reply bytes
    }

    s32 status;
    if( (status=ESP8266_FW_Read(buffer, len_ret)) < 0 ) {
#if DEBUG_VERBOSE_LEVEL >= 2
      DEBUG_MSG("[ESP8266_FW_ReceiveReply] failed to read payload, status %d\n", status);
#endif
      return -7; // failed read
    }
    //MIOS32_MIDI_SendDebugHexDump((u8 *)buffer, len_ret);
  }

  {
    u8 c;
    s32 status;
    if( (status=ESP8266_FW_Read(&c, 1)) < 0 ) {
#if DEBUG_VERBOSE_LEVEL >= 2
      DEBUG_MSG("[ESP8266_FW_ReceiveReply] failed to read terminator, status %d\n", status);
#endif
      return -8; // failed read
    }

    if( c != 0xc0 ) {
#if DEBUG_VERBOSE_LEVEL >= 2
      DEBUG_MSG("[ESP8266_FW_ReceiveReply] terminator read returned 0x%02x instead of 0xc0\n", c);
#endif
      return -9; // invalid termination
    }
  }

  return len_ret; // no error: return length of buffer
}

/////////////////////////////////////////////////////////////////////////////
//! send a request and read the response
//! \return < 0 on errors
//! \return >= 0: number of written bytes
/////////////////////////////////////////////////////////////////////////////
s32 ESP8266_FW_SendCommand(u8 op, u8 *buffer, u32 size, u8 chk, u32 *reply_val, u8 *reply_buffer, u32 reply_buffer_max_size)
{
  if( op ) {
    u8 cmd[8];

    cmd[0] = 0x00;
    cmd[1] = op;
    cmd[2] = (size >> 0) & 0xff;
    cmd[3] = (size >> 8) & 0xff;
    cmd[4] = chk;
    cmd[5] = 0;
    cmd[6] = 0;
    cmd[7] = 0;

    if( ESP8266_FW_Write(cmd, 8, buffer, size) < 0 )
      return -2; // transfer failed
  }

  // tries to get a response until that response has the
  // same operation as the request or a retries limit has
  // exceeded. This is needed for some esp8266s that
  // reply with more sync responses than expected.
  int retries = (op == ESP_SYNC) ? 5 : 50;
  for(; retries > 0; --retries) {
    u8 op_ret;
    s32 status = ESP8266_FW_ReceiveReply(&op_ret, reply_val, reply_buffer, reply_buffer_max_size);

    if( op == 0 || op_ret == op ) {
      return status; // == length of reply_buffer
    }
  }

  return -5; // no valid response
}

/////////////////////////////////////////////////////////////////////////////
//! Perform a connection test
//! \return < 0 on errors
//! \return >= 0: number of written bytes
/////////////////////////////////////////////////////////////////////////////
s32 ESP8266_FW_Sync(void)
{
  u8 cmd[36];
  cmd[0] = 0x07;
  cmd[1] = 0x07;
  cmd[2] = 0x12;
  cmd[3] = 0x20;
  {
    int i;
    for(i=0; i<0x20; ++i) {
      cmd[4+i] = 0x55;
    }
  }

  {
    u32 reply_val;
    u8 reply_buffer[2];

    s32 status = ESP8266_FW_SendCommand(ESP_SYNC, cmd, sizeof(cmd), 0x00, &reply_val, reply_buffer, sizeof(reply_buffer));

    if( status < 0 )
      return -2; // failed to send command
    int i;
    for(i=0; i<7; ++i) {
      s32 status = ESP8266_FW_SendCommand(0, NULL, 0, 0x00, &reply_val, reply_buffer, sizeof(reply_buffer));

      if( status < 0 ) {
#if DEBUG_VERBOSE_LEVEL >= 2
	DEBUG_MSG("[ESP8266_SwSync] didn't get reply #%d", i+1);
#endif
	return -3; // failed to receive replies
      }
    }
  }

