midibox/mios32/modules/esp8266/esp8266_fw.c
  return 0; // no error
}


/////////////////////////////////////////////////////////////////////////////
//! Read memory address in target
/////////////////////////////////////////////////////////////////////////////
s32 ESP8266_FW_ReadReg(u32 addr, u32 *ret_value)
{
  u8 cmd[4] = {
    (addr >> 0) & 0xff,
    (addr >> 8) & 0xff,
    (addr >> 16) & 0xff,
    (addr >> 24) & 0xff
  };

  {
    u8 reply_buffer[2];
    *ret_value = 0;

    s32 status = ESP8266_FW_SendCommand(ESP_READ_REG, cmd, sizeof(cmd), 0x00, ret_value, reply_buffer, sizeof(reply_buffer));

    if( status < 0 )
      return -2; // failed to send command

    if( status != 2 || reply_buffer[0] != 0 || reply_buffer[1] != 0 ) {
#if DEBUG_VERBOSE_LEVEL >= 2
      DEBUG_MSG("[ESP8266_FW_ReadReg] unexpected reply:\n");
      MIOS32_MIDI_SendDebugHexDump((u8 *)reply_buffer, status);
#endif
      return -3;
    }
  }

  return 0; // no error
}


/////////////////////////////////////////////////////////////////////////////
//! Write to memory address in target
/////////////////////////////////////////////////////////////////////////////
s32 ESP8266_FW_WriteReg(u32 addr, u32 value, u32 mask, u32 delay_us)
{
  u8 cmd[16] = {
    (addr >> 0) & 0xff,
    (addr >> 8) & 0xff,
    (addr >> 16) & 0xff,
    (addr >> 24) & 0xff,
    (value >> 0) & 0xff,
    (value >> 8) & 0xff,
    (value >> 16) & 0xff,
    (value >> 24) & 0xff,
    (mask >> 0) & 0xff,
    (mask >> 8) & 0xff,
    (mask >> 16) & 0xff,
    (mask >> 24) & 0xff,
    (delay_us >> 0) & 0xff,
    (delay_us >> 8) & 0xff,
    (delay_us >> 16) & 0xff,
    (delay_us >> 24) & 0xff
  };

  {
    u8 reply_buffer[2];

    u32 dummy_value = 0;
    s32 status = ESP8266_FW_SendCommand(ESP_WRITE_REG, cmd, sizeof(cmd), 0x00, &dummy_value, reply_buffer, sizeof(reply_buffer));

    if( status < 0 )
      return -2; // failed to send command

    if( status != 2 || reply_buffer[0] != 0 || reply_buffer[1] != 0 ) {
#if DEBUG_VERBOSE_LEVEL >= 2
      DEBUG_MSG("[ESP8266_FW_WriteReg] unexpected reply:\n");
      MIOS32_MIDI_SendDebugHexDump((u8 *)reply_buffer, status);
#endif
      return -3;
    }
  }

  return 0; // no error
}


/////////////////////////////////////////////////////////////////////////////
//! Start downloading an application image to RAM
/////////////////////////////////////////////////////////////////////////////
s32 ESP8266_FW_MemBegin(u32 size, u32 blocks, u32 blocksize, u32 offset)
{
  u8 cmd[16] = {
    (size >> 0) & 0xff,
    (size >> 8) & 0xff,
    (size >> 16) & 0xff,
    (size >> 24) & 0xff,
    (blocks >> 0) & 0xff,
    (blocks >> 8) & 0xff,
    (blocks >> 16) & 0xff,
    (blocks >> 24) & 0xff,
    (blocksize >> 0) & 0xff,
    (blocksize >> 8) & 0xff,
    (blocksize >> 16) & 0xff,
    (blocksize >> 24) & 0xff,
    (offset >> 0) & 0xff,
    (offset >> 8) & 0xff,
    (offset >> 16) & 0xff,
    (offset >> 24) & 0xff
  };

  {
    u8 reply_buffer[2];

    u32 dummy_value = 0;
    s32 status = ESP8266_FW_SendCommand(ESP_MEM_BEGIN, cmd, sizeof(cmd), 0x00, &dummy_value, reply_buffer, sizeof(reply_buffer));

    if( status < 0 )
      return -2; // failed to send command

    if( status != 2 || reply_buffer[0] != 0 || reply_buffer[1] != 0 ) {
#if DEBUG_VERBOSE_LEVEL >= 2
      DEBUG_MSG("[ESP8266_FW_MemBegin] unexpected reply:\n");
      MIOS32_MIDI_SendDebugHexDump((u8 *)reply_buffer, status);
#endif
      return -3;
    }
  }

  return 0; // no error
}


/////////////////////////////////////////////////////////////////////////////
//! Send a block of an image to RAM
/////////////////////////////////////////////////////////////////////////////
s32 ESP8266_FW_MemBlock(u8 *buffer, u32 size, u32 seq)
{
  // 256 bytes maximum
  if( size > ESP_RAM_BLOCK ) {
    return -4;
  }

  u8 cmd[ESP_RAM_BLOCK+16] = { // preload first 16 byte
    (size >> 0) & 0xff,
    (size >> 8) & 0xff,
    (size >> 16) & 0xff,
    (size >> 24) & 0xff,
    (seq >> 0) & 0xff,
    (seq >> 8) & 0xff,
    (seq >> 16) & 0xff,
    (seq >> 24) & 0xff,
    0, 0, 0, 0,
    0, 0, 0, 0
  };

  // copy remaining bytes
  memcpy(&cmd[16], buffer, size);

  // create checksum
  u8 chk = ESP8266_FW_Checksum(buffer, size, ESP_CHECKSUM_MAGIC);

  // send block
  {
    u8 reply_buffer[2];

    u32 dummy_value = 0;
    s32 status = ESP8266_FW_SendCommand(ESP_MEM_DATA, cmd, 16+size, chk, &dummy_value, reply_buffer, sizeof(reply_buffer));

    if( status < 0 )
      return -2; // failed to send command

    if( status != 2 || reply_buffer[0] != 0 || reply_buffer[1] != 0 ) {
#if DEBUG_VERBOSE_LEVEL >= 2
      DEBUG_MSG("[ESP8266_FW_MemBlock] unexpected reply:\n");
      MIOS32_MIDI_SendDebugHexDump((u8 *)reply_buffer, status);
#endif
      return -3;
    }
  }

  return 0; // no error
}


/////////////////////////////////////////////////////////////////////////////
//! Leave download mode and run the application
/////////////////////////////////////////////////////////////////////////////
s32 ESP8266_FW_MemFinish(u32 entry_point)
{
  u8 cmd[8] = {
    (entry_point == 0) ? 1 : 0, 0, 0, 0,
    (entry_point >> 0) & 0xff,
    (entry_point >> 8) & 0xff,
    (entry_point >> 16) & 0xff,
    (entry_point >> 24) & 0xff
  };

  {
    u8 reply_buffer[2];

    u32 dummy_value = 0;
    s32 status = ESP8266_FW_SendCommand(ESP_MEM_END, cmd, sizeof(cmd), 0x00, &dummy_value, reply_buffer, sizeof(reply_buffer));

    if( status < 0 )
      return -2; // failed to send command

    if( status != 2 || reply_buffer[0] != 0 || reply_buffer[1] != 0 ) {
#if DEBUG_VERBOSE_LEVEL >= 2
      DEBUG_MSG("[ESP8266_FW_MemFinish] unexpected reply:\n");
      MIOS32_MIDI_SendDebugHexDump((u8 *)reply_buffer, status);
#endif
      return -3;
    }
  }

  return 0; // no error
}


/////////////////////////////////////////////////////////////////////////////
//! Start downloading an application image to Flash (performs an erase)
/////////////////////////////////////////////////////////////////////////////
s32 ESP8266_FW_FlashBegin(u32 size, u32 offset)
{
  u32 num_blocks = (size + ESP_FLASH_BLOCK - 1) / ESP_FLASH_BLOCK;
  u32 sectors_per_block = 16;
  u32 sector_size = 4096;
  u32 num_sectors = (size + sector_size - 1) / sector_size;
  u32 start_sector = offset / sector_size;

  u32 head_sectors = sectors_per_block - (start_sector % sectors_per_block);
  if( num_sectors < head_sectors )
    head_sectors = num_sectors;

  u32 erase_size;
  if( num_sectors < 2 * head_sectors )
    erase_size = (num_sectors + 1) / 2 * sector_size;
  else
    erase_size = (num_sectors - head_sectors) * sector_size;

  u8 cmd[16] = {
    (erase_size >> 0) & 0xff,
    (erase_size >> 8) & 0xff,
    (erase_size >> 16) & 0xff,
    (erase_size >> 24) & 0xff,
    (num_blocks >> 0) & 0xff,
    (num_blocks >> 8) & 0xff,
    (num_blocks >> 16) & 0xff,
    (num_blocks >> 24) & 0xff,
    (ESP_FLASH_BLOCK >> 0) & 0xff,
    (ESP_FLASH_BLOCK >> 8) & 0xff,
    (ESP_FLASH_BLOCK >> 16) & 0xff,
    (ESP_FLASH_BLOCK >> 24) & 0xff,
    (offset >> 0) & 0xff,
    (offset >> 8) & 0xff,
    (offset >> 16) & 0xff,
    (offset >> 24) & 0xff
  };

  {
    u8 reply_buffer[2];

