midibox/mios32/modules/esp8266/esp8266_fw.c
    u32 dummy_value = 0;
    s32 status = ESP8266_FW_SendCommand(ESP_FLASH_BEGIN, cmd, sizeof(cmd), 0x00, &dummy_value, reply_buffer, sizeof(reply_buffer));

    if( status < 0 )
      return -2; // failed to send command

    if( status != 2 || reply_buffer[0] != 0 || reply_buffer[1] != 0 ) {
#if DEBUG_VERBOSE_LEVEL >= 2
      DEBUG_MSG("[ESP8266_FW_MemFlash] Failed to enter flash download mode:\n");
      MIOS32_MIDI_SendDebugHexDump((u8 *)reply_buffer, status);
#endif
      return -3;
    }
  }

  return 0; // no error
}


/////////////////////////////////////////////////////////////////////////////
//! Send a block of an image to Flash
/////////////////////////////////////////////////////////////////////////////
s32 ESP8266_FW_FlashBlock(u8 *buffer, u32 size, u32 seq)
{
  // 1024 bytes maximum
  if( size > ESP_FLASH_BLOCK ) {
    return -4;
  }

  u8 cmd[ESP_FLASH_BLOCK+16] = { // preload first 16 byte
    (size >> 0) & 0xff,
    (size >> 8) & 0xff,
    (size >> 16) & 0xff,
    (size >> 24) & 0xff,
    (seq >> 0) & 0xff,
    (seq >> 8) & 0xff,
    (seq >> 16) & 0xff,
    (seq >> 24) & 0xff,
    0, 0, 0, 0,
    0, 0, 0, 0
  };

  // copy remaining bytes
  memcpy(&cmd[16], buffer, size);

  // create checksum
  u8 chk = ESP8266_FW_Checksum(buffer, size, ESP_CHECKSUM_MAGIC);

  // send block
  {
    u8 reply_buffer[2];

    u32 dummy_value = 0;
    s32 status = ESP8266_FW_SendCommand(ESP_FLASH_DATA, cmd, 16+size, chk, &dummy_value, reply_buffer, sizeof(reply_buffer));

    if( status < 0 )
      return -2; // failed to send command

    if( status != 2 || reply_buffer[0] != 0 || reply_buffer[1] != 0 ) {
#if DEBUG_VERBOSE_LEVEL >= 2
      DEBUG_MSG("[ESP8266_FW_FlashBlock] unexpected reply:\n");
      MIOS32_MIDI_SendDebugHexDump((u8 *)reply_buffer, status);
#endif
      return -3;
    }
  }

  return 0; // no error
}


/////////////////////////////////////////////////////////////////////////////
//! Leave flash mode and run/reboot
/////////////////////////////////////////////////////////////////////////////
s32 ESP8266_FW_FlashFinish(u32 reboot)
{
  u8 cmd[4] = {
    (reboot == 0) ? 1 : 0, 0, 0, 0
  };

  {
    u8 reply_buffer[2];

    u32 dummy_value = 0;
    s32 status = ESP8266_FW_SendCommand(ESP_FLASH_END, cmd, sizeof(cmd), 0x00, &dummy_value, reply_buffer, sizeof(reply_buffer));

    if( status < 0 )
      return -2; // failed to send command

    if( status != 2 || reply_buffer[0] != 0 || reply_buffer[1] != 0 ) {
#if DEBUG_VERBOSE_LEVEL >= 2
      DEBUG_MSG("[ESP8266_FW_FlashFinish] unexpected reply:\n");
      MIOS32_MIDI_SendDebugHexDump((u8 *)reply_buffer, status);
#endif
      return -3;
    }
  }

  return 0; // no error
}

/////////////////////////////////////////////////////////////////////////////
//! Perform a chip erase of SPI flash
/////////////////////////////////////////////////////////////////////////////
s32 ESP8266_FW_FlashErase(void)
{
  // This is hacky: we don't have a custom stub, instead we trick
  // the bootloader to jump to the SPIEraseChip() routine and then halt/crash
  // when it tries to boot an unconfigured system.
  if( ESP8266_FW_FlashBegin(0, 0) >= 0 &&
      ESP8266_FW_MemBegin(0, 0, 0, 0x40100000) >= 0 &&
      ESP8266_FW_MemFinish(0x40004984) >= 0 ) {
    // success

    // there is no way to detect iw we really successed...
  } else {
#if DEBUG_VERBOSE_LEVEL >= 2
      DEBUG_MSG("[ESP8266_FW_ReadChipId] failed to read MAC registers\n");
#endif
      return -1;
  }

  return 0; // no error
}


/////////////////////////////////////////////////////////////////////////////
//! Programs the SPI flash
/////////////////////////////////////////////////////////////////////////////
s32 ESP8266_FW_FlashProg(u8 *image, u32 size, u32 addr)
{
  s32 status = 0;

#if DEBUG_VERBOSE_LEVEL >= 2
  DEBUG_MSG("[ESP8266_FW_FlashProg] Erasing Flash at 0x%06x...\n", addr);
#endif
  u32 blocks = (size / ESP_FLASH_BLOCK) + (((size % ESP_FLASH_BLOCK) != 0) ? 1 : 0); // rounding upwards
  status |=  ESP8266_FW_FlashBegin(blocks * ESP_FLASH_BLOCK, addr);

  u32 seq = 0;
  u32 offset = 0;
  for(offset=0; offset<size && status >= 0; offset += ESP_FLASH_BLOCK, ++seq) {
    DEBUG_MSG("[ESP8266_FW_FlashProg] Writing at 0x%06x... (%d%%)\n", addr + seq*ESP_FLASH_BLOCK, 100 * (seq+1) / blocks);
    status |= ESP8266_FW_FlashBlock((u8 *)&image[offset], ESP_FLASH_BLOCK, seq);
  }

  if( status < 0 ) {
    DEBUG_MSG("[ESP8266_FW_FlashProg] Failure during block programming!\n");
    return -1;
  }

  return 0; // no error
}


/////////////////////////////////////////////////////////////////////////////
//! Run application code in flash
/////////////////////////////////////////////////////////////////////////////
s32 ESP8266_FW_Run(u32 reboot)
{
  // fake flash begin immediately followed by flash end
  s32 status = ESP8266_FW_FlashBegin(0, 0);
  status |= ESP8266_FW_FlashFinish(reboot);
  return status;
}


/////////////////////////////////////////////////////////////////////////////
//! Read MAC from OTP ROM
/////////////////////////////////////////////////////////////////////////////
s32 ESP8266_FW_ReadMac(u8 mac[6])
{
  u32 mac0, mac1, mac3;
  if( ESP8266_FW_ReadReg(ESP_OTP_MAC0, &mac0) >= 0 &&
      ESP8266_FW_ReadReg(ESP_OTP_MAC1, &mac1) >= 0 &&
      ESP8266_FW_ReadReg(ESP_OTP_MAC3, &mac3) >= 0 ) {

    if( mac3 != 0 ) {
      mac[0] = (mac3 >> 16) & 0xff;
      mac[1] = (mac3 >> 8) & 0xff;
      mac[2] = mac3 & 0xff;
    } else if( ((mac1 >> 16) & 0xff) == 0 ) {
      mac[0] = 0x18;
      mac[1] = 0xfe;
      mac[2] = 0x34;
    } else if( ((mac1 >> 16) & 0xff) == 1 ) {
      mac[0] = 0xac;
      mac[1] = 0xd0;
      mac[2] = 0x74;
    } else {
#if DEBUG_VERBOSE_LEVEL >= 2
      DEBUG_MSG("[ESP8266_FW_ReadMac] unknown OUI!\n");
#endif
      return -2;
    }

    mac[3] = (mac1 >> 8) & 0xff;
    mac[4] = mac1 & 0xff;
    mac[5] = (mac0 >> 24) & 0xff;
  } else {
#if DEBUG_VERBOSE_LEVEL >= 2
      DEBUG_MSG("[ESP8266_FW_ReadMac] failed to read MAC registers\n");
#endif
      return -1;
  }

