midibox/mios32/modules/esp8266/esp8266_fw.c
  return 0; // no error
}


/////////////////////////////////////////////////////////////////////////////
//! Read ChipID from OTP ROM
//! see http://esp8266-re.foogod.com/wiki/System_get_chip_id_%28IoT_RTOS_SDK_0.9.9%29
/////////////////////////////////////////////////////////////////////////////
s32 ESP8266_FW_ReadChipId(u32 *chip_id)
{
  u32 mac0, mac1;
  if( ESP8266_FW_ReadReg(ESP_OTP_MAC0, &mac0) >= 0 &&
      ESP8266_FW_ReadReg(ESP_OTP_MAC1, &mac1) >= 0 ) {

    *chip_id = (mac0 >> 24) | ((mac1 & 0xffffff) << 8);
  } else {
#if DEBUG_VERBOSE_LEVEL >= 2
      DEBUG_MSG("[ESP8266_FW_ReadChipId] failed to read MAC registers\n");
#endif
      return -1;
  }

  return 0; // no error
}


/////////////////////////////////////////////////////////////////////////////
//! Read Flash ID
/////////////////////////////////////////////////////////////////////////////
s32 ESP8266_FW_ReadFlashId(u32 *flash_id)
{
  if( ESP8266_FW_FlashBegin(0, 0) >= 0 &&
      ESP8266_FW_WriteReg(0x60000240, 0x00000000, ~0, 0) >= 0 &&
      ESP8266_FW_WriteReg(0x60000200, 0x10000000, ~0, 0) >= 0 &&
      ESP8266_FW_ReadReg(0x60000240, flash_id) >= 0 ) {
    // success

    // Disabled: this would reboot the FW (regardless if reboot flag is set or not...)
    // ESP8266_FW_FlashFinish(0);
  } else {
#if DEBUG_VERBOSE_LEVEL >= 2
      DEBUG_MSG("[ESP8266_FW_ReadChipId] failed to read MAC registers\n");
#endif
      return -1;
  }

  return 0; // no error
}


/////////////////////////////////////////////////////////////////////////////
//! Executes the ESP8266 firmware
//! \param[in] cmd the command which should be executed
//! \return < 0 on errors
/////////////////////////////////////////////////////////////////////////////
s32 ESP8266_FW_Exec(esp8266_fw_exec_cmd_t exec_cmd)
{
  u8 dev_uart = ESP8266_UartGet();
  if( !dev_uart )
    return -1; // no UART configured

  u8 uart = dev_uart & 0xf;

  // disable terminal so that we can directly receive messages
  ESP8266_TerminalModeSet(0);

  // allow to send debug message
  ESP8266_MUTEX_MIDIOUT_TAKE;

  DEBUG_MSG("Connecting to ESP8266 in BootROM mode\n");

  int fail_ctr = 0;
  {
    int i;

    for(i=0; i<4; ++i) {
      DEBUG_MSG("Sync #%d", i+1);

      // flush receive buffer
      timeout_ctr = 100; // wait for up to 100 uS
      while( timeout_ctr )
	MIOS32_UART_RxBufferGet(uart);

      // send Sync command
      s32 status = ESP8266_FW_Sync();
      if( status < 0 ) {
	++fail_ctr;
	if( i == 0 )
	  DEBUG_MSG("Sync failed with status=%d, this can happen during first try - don't panic, we try again!\n", status);
	else
	  DEBUG_MSG("ERROR: Sync failed with status=%d\n", status);
      }
    }
  }

  if( fail_ctr >= 2 ) {
    DEBUG_MSG("ERROR: More than 2 fails - connection error!\n");
    DEBUG_MSG("Probably the UART bootloader isn't running!\n");
    DEBUG_MSG("Please:\n");
    DEBUG_MSG("  - set the ESP8266 GPIO0 pin to ground\n");
    DEBUG_MSG("  - trigger ESP8266 RST pin (shortly connect ground)\n");
    DEBUG_MSG("  - disconnect the ESP8266 GPIO0 pin from ground\n");
    DEBUG_MSG("Then try again.\n");
  } else {
    fail_ctr = 0;

    // Show MAC
    {
      u8 mac[6];
      if( ESP8266_FW_ReadMac(mac) < 0 ) {
	++fail_ctr;
	DEBUG_MSG("ERROR: failed to determine MAC!\n");
      } else {
	DEBUG_MSG("MAC: %02X:%02X:%02X:%02X:%02X:%02X\n",
		  mac[0], mac[1], mac[2], mac[3], mac[4], mac[5]);
      }
    }

    // Show ChipID
    {
      u32 chip_id;
      if( ESP8266_FW_ReadChipId(&chip_id) < 0 ) {
	++fail_ctr;
	DEBUG_MSG("ERROR: failed to determine Chip ID!\n");
      } else {
	DEBUG_MSG("Chip ID: 0x%08X\n", chip_id);
      }
    }

    // Show Flash Manufacturer and Device ID
    {
      u32 flash_id;
      if( ESP8266_FW_ReadFlashId(&flash_id) < 0 ) {
	++fail_ctr;
	DEBUG_MSG("ERROR: failed to determine Flash ID!\n");
      } else {
	DEBUG_MSG("Flash ID: 0x%08X\n", flash_id);
	DEBUG_MSG("Flash Size: %dk\n", (1 << (flash_id >> 16)) / 1024);
      }
    }
  }


  switch( exec_cmd ) {
  case ESP8266_FW_EXEC_CMD_QUERY: {
    if( fail_ctr ) {
      DEBUG_MSG("ERROR: bootloader communication wasn't successfull!\n");
    } else {
      DEBUG_MSG("Bootloader communication successfull!\n");
    }
  } break;

  case ESP8266_FW_EXEC_CMD_ERASE_FLASH: {
    if( fail_ctr ) {
      DEBUG_MSG("ERROR: due to communication failures the flash won't be erased!\n");
    } else {
      DEBUG_MSG("Erasing flash...\n");
      if( ESP8266_FW_FlashErase() < 0 ) {
	DEBUG_MSG("ERROR: flash erase failed!\n");
      } else {
	DEBUG_MSG("Wait some seconds, thereafter reset the ESP8266 device in bootloader mode!\n");
      }
    }
  } break;

  case ESP8266_FW_EXEC_CMD_PROG_FLASH: {
    if( fail_ctr ) {
      DEBUG_MSG("ERROR: due to communication failures the flash won't be programmed!\n");
    } else {
      DEBUG_MSG("Programming firmware...\n");

      if( ESP8266_FW_FlashProg((u8 *)esp8266_fw_img_0x00000, sizeof(esp8266_fw_img_0x00000), 0x00000) < 0 ) {
	DEBUG_MSG("ERROR: failed to program fw_img_0x00000!\n");
      } else if( ESP8266_FW_FlashProg((u8 *)esp8266_fw_img_upper, sizeof(esp8266_fw_img_upper), ESP8266_FW_FIRMWARE_UPPER_BASE_ADDRESS) < 0 ) {
	DEBUG_MSG("ERROR: failed to program fw_img_upper!\n");
      } else {
	DEBUG_MSG("Programming done...\n");
	DEBUG_MSG("Booting new firmware...\n");
	ESP8266_FW_FlashFinish(1);
      }
    }
  } break;

  default:
    DEBUG_MSG("ERROR: unexpected EXEC_CMD: %d\n", exec_cmd);
  }

  ESP8266_MUTEX_MIDIOUT_GIVE;

  // enable terminal again
  ESP8266_TerminalModeSet(1);

  return fail_ctr ? -2 : 0;
}

#endif /* ESP8266_FW_ACCESS_ENABLED */

//! \}
